import os



money=500
def shop_ui():
    #Оформление
    os.system('cls')
    print('.' * 156)
    print('''.                                                                                                                                                          .
.                                                     |\  /|   /\   |‾‾‾  /\   ‾‾‾‾| |  /| |  |                                                            .
.                                                     | \/ |  /__\  |    /__\  ----| | / | |--|                                                            .
.                                                     |    | /    \ |   /    \ ____| |/  | |  |                                                            .
.                                                                                                                                                          .''')
    print('.' * 156)

    #Баланс игрока
    print(" " * 67, "Ваш баланс:", money)