import time
from time import sleep
import random
from random import uniform
x="•"
y=0
z=0
while int(y)<=150 and int(z)<=150:
    y+=uniform(1,5)
    sleep(0.1)
    print(
        x*15+">>>>>>>>>>>\n"+x*int(y)+
        "┈┏┓┈██┈┈┈███┈┈┈┈\n"+x*int(y)+
        "┈┃┃╭┻┻━━━┻━┻┏┓┈\n" +x*int(y)+
        "┈┃┣╯┉┉╭━━┓╭┉┃┃┈\n"+x*int(y)+
        "┈┃┣╮┉┉╰━━┛╰┉┃┃┈\n"+x*int(y)+
        "┈┃┃╰┳┳━━━┳━┳┗┛┈\n" +x*int(y)+
        "┈┗┛┈██┈┈┈███┈┈┈┈\n"+x*int(y)+
        ">>>>>>>>>>>>>>>>>"
    )

    z += uniform(1,5)

    print(
        x*15+">>>>>>>>>>>\n"+x*int(z)+
        "┈┏┓┈██┈┈┈███┈┈┈┈\n"+x*int(z)+
        "┈┃┃╭┻┻━━━┻━┻┏┓┈\n" +x*int(z)+
        "┈┃┣╯┉┉╭━━┓╭┉┃┃┈\n"+x*int(z)+
        "┈┃┣╮┉┉╰━━┛╰┉┃┃┈\n"+x*int(z)+
        "┈┃┃╰┳┳━━━┳━┳┗┛┈\n" +x*int(z)+
        "┈┗┛┈██┈┈┈███┈┈┈┈\n"+x*int(z)+
        ">>>>>>>>>>>>>>>>>"
    )
if z>y:
    print("ВЫИГРАЛА ВТОРАЯ МАШИНА!!!!"
          "\n╲╲╲╲┗━━┳┳━━┛╱╱╱╱"
          "\n╲╲╭━━╮╭┻┻╮╭━━╮╱╱"
          "\n╲╲┃┊┊┣┫╭╮┣┫┊┊┃╱╱"
          "\n╲╲╰━╭┻╯┃┃╰┻╮━╯╱╱"
          "\n╲╭━╮╭━╲╭╮╱━╮╭━╮╱"
          "\n╲┃┊┣┻━━╰╯━━┻┫┊┃╱"
          "\n┈╰━┗━━━━━━━━┛━╯╱"
          "\nВЫИГРАЛА ВТОРАЯ МАШИНА!!!!")
else:
    print("ВЫИГРАЛА ПЕРВАЯ МАШИНА!!!!"
          "\n╲╲╲╲┗━━┳┳━━┛╱╱╱╱"
          "\n╲╲╭━━╮╭┻┻╮╭━━╮╱╱"
          "\n╲╲┃┊┊┣┫╭╮┣┫┊┊┃╱╱"
          "\n╲╲╰━╭┻╯┃┃╰┻╮━╯╱╱"
          "\n╲╭━╮╭━╲╭╮╱━╮╭━╮╱"
          "\n╲┃┊┣┻━━╰╯━━┻┫┊┃╱"
          "\n┈╰━┗━━━━━━━━┛━╯╱"
          "\nВЫИГРАЛА ПЕРВАЯ МАШИНА!!!!")











#••••••••••••
