from cars import carsMatch
def win_los():
    x=" "
    y=0
    z=0
    while int(y)<=137 and int(z)<=137:
        carsMatch(x,y,z)
        z,y=carsMatch(x,y,z)
    if z>y:
        print(
            """
                                                       ВЫИГРАЛА ВТОРАЯ МАШИНА!!!!
                                                           ╲╲╲╲┗━━┳┳━━┛╱╱╱╱
                                                           ╲╲╭━━╮╭┻┻╮╭━━╮╱╱
                                                           ╲╲┃┊┊┣┫╭╮┣┫┊┊┃╱╱
                                                           ╲╲╰━╭┻╯┃┃╰┻╮━╯╱╱
                                                           ╲╭━╮╭━╲╭╮╱━╮╭━╮╱
                                                           ╲┃┊┣┻━━╰╯━━┻┫┊┃╱
                                                           ┈╰━┗━━━━━━━━┛━╯╱
                                                       ВЫИГРАЛА ВТОРАЯ МАШИНА!!!!
        """)
    else:
        print(
            """
                                                        ВЫИГРАЛА ПЕРВАЯ МАШИНА!!!!
                                                            ╲╲╲╲┗━━┳┳━━┛╱╱╱╱
                                                            ╲╲╭━━╮╭┻┻╮╭━━╮╱╱
                                                            ╲╲┃┊┊┣┫╭╮┣┫┊┊┃╱╱
                                                            ╲╲╰━╭┻╯┃┃╰┻╮━╯╱╱
                                                            ╲╭━╮╭━╲╭╮╱━╮╭━╮╱
                                                            ╲┃┊┣┻━━╰╯━━┻┫┊┃╱
                                                            ┈╰━┗━━━━━━━━┛━╯╱
                                                        ВЫИГРАЛА ПЕРВАЯ МАШИНА!!!!
        """)





