from cars import carsMatch
def win_los():
    x="•"
    y=0
    z=0
    while int(y)<=137 and int(z)<=137:
        carsMatch(x,y,z)
        z,y=carsMatch(x,y,z)
    if z>y:
        print("ВЫИГРАЛА ВТОРАЯ МАШИНА!!!!"
              "\n╲╲╲╲┗━━┳┳━━┛╱╱╱╱"
              "\n╲╲╭━━╮╭┻┻╮╭━━╮╱╱"
              "\n╲╲┃┊┊┣┫╭╮┣┫┊┊┃╱╱"
              "\n╲╲╰━╭┻╯┃┃╰┻╮━╯╱╱"
              "\n╲╭━╮╭━╲╭╮╱━╮╭━╮╱"
              "\n╲┃┊┣┻━━╰╯━━┻┫┊┃╱"
              "\n┈╰━┗━━━━━━━━┛━╯╱"
              "\nВЫИГРАЛА ВТОРАЯ МАШИНА!!!!")
    else:
        print("ВЫИГРАЛА ПЕРВАЯ МАШИНА!!!!"
              "\n╲╲╲╲┗━━┳┳━━┛╱╱╱╱"
              "\n╲╲╭━━╮╭┻┻╮╭━━╮╱╱"
              "\n╲╲┃┊┊┣┫╭╮┣┫┊┊┃╱╱"
              "\n╲╲╰━╭┻╯┃┃╰┻╮━╯╱╱"
              "\n╲╭━╮╭━╲╭╮╱━╮╭━╮╱"
              "\n╲┃┊┣┻━━╰╯━━┻┫┊┃╱"
              "\n┈╰━┗━━━━━━━━┛━╯╱"
              "\nВЫИГРАЛА ПЕРВАЯ МАШИНА!!!!")





